
public class CH_4 {
	// 연산자
	public static void main(String[] args) {
		// 피연산자의 개수에 따른 구분
		// 단항 연산자(+x, -x, !x), 이항 연산자(x=y, x<y, x!=y ), 삼항 연산자(true ? false)
		
		// 대입 연산자
		// 오른쪽의 결과를 왼쪽에 대입(할당)한다. (==가 같다는 의미, =는 대입)
		
		// 산술 연산자
		// 피연산자를 이용하여 +, -, *, /, % 등을 수행한다(x + y, x - y, x * y)
		
		// 복합 대입연산자
		// 산술 연산자와 대입 연산자를 결합한 연산자 ( +=, -=, *=, /=, %=)
		
		// 관계 연산자
		// 두개의 피연산자를 비교, 참/거짓의 결론을 도출한다. (>, <, >=, <=, ==, !=)
		
		// 증감 연산자
		// 1만큼 증가 하거나 감소를 수행한다. (++, --)
		
		// 논리 연산자
		// 피연산자의 논리곱, 논리합, 논리부정을 수행
		// && : 논리곱, || : 논리합, ! : 논리부정
		
		// 조건(삼항) 연산자
		// 두개의 피연산자 연산 결과에 따라서 나머지 피연산자가 결정
		// 조건식 ? 식1 : 식2
		// 조건식이 참이면 식1, 거짓이면 식2가 실행
		
		// 비트 연산자(잘 안쓰임)
		// 데이터를 비트 단위로 환산하여 연산을 수행, 다른 연산자보다 연산 속도 향상
		// x = 2 : 00000010
		// y = 3 : 00000011
		// 곱     : 00000010(2)
		// 합     : 00000011(3)
		// xor   : 00000001(1) : a와 b가 같지 않으면 1
	}
	
}
